app/views/properties/_form.html.erb

    <div class="col-sm-10">
      <%= f.collection_select :landlord_id, Landlord.all, :id, :landlord_full_name %>
---
SELECT "landlords".* FROM "landlords"