app/views/properties/index.html.erb

            <td><%= link_to property.address, property %></td>
            <td><%= link_to property.landlord.first_name + ' ' + property.landlord.last_name, property.landlord %></td>
---
SELECT  "landlords".* FROM "landlords"  WHERE "landlords"."id" = $1 LIMIT 1

              <% if tenant.property_id == property.id %>
                <td><%= link_to tenant.first_name + ' ' + tenant.last_name, 'tenants/' + tenant.id.to_s %></td>
---
SELECT  "tenants".* FROM "tenants"   ORDER BY "tenants"."id" ASC LIMIT 1000