app/views/properties/show.html.erb

                    <% else %>
                    <strong>Name:</strong><%= @property.landlord.first_name + ' ' + @property.landlord.last_name %></br>
---
SELECT  "landlords".* FROM "landlords"  WHERE "landlords"."id" = ? LIMIT 1

                    <% else %>
                      <strong>Name:</strong><%= @property.tenant.first_name + ' ' + @property.tenant.last_name %></br>
---
SELECT  "tenants".* FROM "tenants"  WHERE (1)  ORDER BY "tenants"."id" ASC LIMIT 1