app/controllers/contractors_controller.rb

  def index
    @contractors = Contractor.all
---
SELECT "contractors".* FROM "contractors"

  def create
    @contractor = Contractor.new(contractor_params)

    respond_to do |format|
      if @contractor.save
---
INSERT INTO "contractors" ("company_name", "created_at", "email", "industry_type", "jobs_completed", "jobs_feedback_bad", "jobs_feedback_good", "tel", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_contractor
      @contractor = Contractor.find(params[:id])
---
SELECT  "contractors".* FROM "contractors"  WHERE "contractors"."id" = ? LIMIT 1  [["id", 1]]