app/controllers/landlords_controller.rb

SELECT "landlords".* FROM "landlords"
---
  def index
    @landlords = Landlord.all

SELECT COUNT(*) FROM "properties"  WHERE "properties"."landlord_id" = 2
---
  def show
    @property_count = Property.where(landlord_id: @landlord.id).count

INSERT INTO "landlords" ("address", "created_at", "date_registered", "email", "first_name", "last_name", "property_id", "tel", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @landlord = Landlord.new(landlord_params)

    respond_to do |format|
      if @landlord.save

SELECT  "landlords".* FROM "landlords"  WHERE "landlords"."id" = $1 LIMIT 1
---
    def set_landlord
      @landlord = Landlord.find(params[:id])