app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties"
SELECT "works".* FROM "works"
UPDATE "properties" SET "active_job" = ?, "updated_at" = ? WHERE "properties"."id" = 4
---
  def index
    @jobs = Work.all
    @properties = Property.all
    @properties.each do |prop|
      @jobs.each do |job|
        if job.property_id == prop.id
          puts "setting property id #{prop.id} to active_job = 1"
          # prop.active_job = "1"
          prop.update(active_job: "1")

SELECT properties.*, (69.09332411348201 * ABS(properties.latitude - 51.341916933000505) * 0.7071067811865475) + (59.836573914187355 * ABS(properties.longitude - -0.10849348499959888) * 0.7071067811865475) AS distance, CASE WHEN (properties.latitude >= 51.341916933000505 AND properties.longitude >= -0.10849348499959888) THEN  45.0 WHEN (properties.latitude <  51.341916933000505 AND properties.longitude >= -0.10849348499959888) THEN 135.0 WHEN (properties.latitude <  51.341916933000505 AND properties.longitude <  -0.10849348499959888) THEN 225.0 WHEN (properties.latitude >= 51.341916933000505 AND properties.longitude <  -0.10849348499959888) THEN 315.0 END AS bearing FROM "properties"  WHERE (properties.latitude BETWEEN 51.197185149889656 AND 51.486648716111354 AND properties.longitude BETWEEN -0.34018610258296583 AND 0.12319913258376808 AND properties.id != 5)  ORDER BY distance ASC
SELECT  "tenants".* FROM "tenants"  WHERE "tenants"."property_id" = ? LIMIT 1  [["property_id", 5]]
SELECT COUNT(*) FROM "works"  WHERE "works"."property_id" = 1
---
  def show


    @property = Property.find(params[:id])
    @property_marker = Gmaps4rails.build_markers(@property) do |prop, marker|
      marker.lat prop.latitude
      marker.lng prop.longitude
      marker.infowindow prop.address
    @tenant = Tenant.where(params[:property_id])
    @job_count = Work.where(params[:property_id]).count

INSERT INTO "properties" ("address", "created_at", "landlord_id", "latitude", "longitude", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    puts ">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>"
    @property = Property.new(property_params)
    puts @property.works

    respond_to do |format|
      if @property.save

UPDATE "properties" SET "active_job" = ?, "updated_at" = ? WHERE "properties"."id" = 1
---
  def update
    respond_to do |format|
      if @property.update(property_params)