app/controllers/tenants_controller.rb

SELECT "tenants".* FROM "tenants"
---
  def index
    @tenants = Tenant.all

INSERT INTO "tenants" ("created_at", "email", "first_name", "last_name", "lease_commenced", "lease_end", "property_id", "tel", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @tenant = Tenant.new(tenant_params)

    respond_to do |format|
      if @tenant.save

UPDATE "tenants" SET "property_id" = ?, "updated_at" = ? WHERE "tenants"."id" = 1  [["property_id", 5], ["updated_at", "2014-11-05 07:12:48.920179"]]
---
  def update
    respond_to do |format|
      if @tenant.update(tenant_params)

SELECT  "tenants".* FROM "tenants"  WHERE "tenants"."id" = $1 LIMIT 1
---
    def set_tenant
      @tenant = Tenant.find(params[:id])