app/controllers/welcome_controller.rb

  def get_data
    @properties = [Property.where.not(active_job:nil).count, Property.all.count, Work.where("completed_at IS NOT NULL").count]
---
SELECT COUNT(*) FROM "works"  WHERE (completed_at IS NOT NULL)