app/controllers/welcome_controller.rb

  def get_data
    @properties = Property.where.not(active_job:nil).count
---
SELECT COUNT(*) FROM "properties"  WHERE ("properties"."active_job" IS NOT NULL)