app/controllers/works_controller.rb

SELECT "works".* FROM "works"
SELECT "properties".* FROM "properties"
---
  def index
    @works = Work.all
    @properties = Property.all
    @works.each do |job|

INSERT INTO "works" ("created_at", "due_date", "job_type", "property_id", "raised_date", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @work = Work.new(work_params)

    respond_to do |format|
      if @work.save

UPDATE "works" SET "job_type" = ?, "updated_at" = ? WHERE "works"."id" = 4
---
  def update
    respond_to do |format|
      if @work.update(work_params)

DELETE FROM "works" WHERE "works"."id" = ?  [["id", 1]]
---
  def destroy
    @work.destroy

SELECT  "works".* FROM "works"  WHERE "works"."id" = $1 LIMIT 1
---
    def set_work
      @work = Work.find(params[:id])